[
    {
        "startTime": "Aug. 2025",
        "endTime": "Present",
        "title": "Software Engineer",
        "location": "cVation - Part of Skaylink",
        "logo": "../images/logos/cvation.svg",
        "link": "https://www.cvation.com/en"
    },
    {
        "startTime": "Sep. 2024",
        "endTime": "Dec. 2024",
        "title": "Class Teacher & Teaching Assistant",
        "location": "Technical University of Denmark - DTU",
        "description": "As a teaching assistant in the courses Deep Learning, Introduction to Programming, and Multivariate Statistics, I have developed strong skills in communicating technically complex topics to individuals with limited prior knowledge, which has strengthened my abilities in both communication and technical guidance.",
        "logo": "../images/logos/dtu.svg",
        "link": "https://www.dtu.dk/english/about/job-and-career/working-at-dtu/career-paths/teaching-assistant-professor-teaching-associate-professor"
    },
    {
        "startTime": "Jul. 2014",
        "endTime": "Okt. 2021",
        "title": "Service Employee & Crew Trainer",
        "location": "McDonald's Hillerød",
        "description": "Throughout 7.5 years, I worked initially as a service employee for 2 years and since 5.5 years as a Crew Trainer. My time at McDonald's has provided me with valuable skills in teamwork, effective communication, thriving in a fast-paced environment and managing stressful situations. Additionally, I have also developed a strong sense of responsibility, both for my own growth within an organisation and supporting the development of others, as well as gaining a deep respect for schedules, structure and leadership.",
        "logo": "../images/logos/mcdonalds.svg",
        "link": "https://www.mcdonalds.com/dk/da-dk/location/hiller-d/hiller-d/herredsvejen-16/103.html"
    },
    {
        "startTime": "Aug. 2013",
        "endTime": "Jul. 2014",
        "title": "Newspaper Deliverer",
        "location": "FK Distribution",
        "description": "Working as a newspaper deliverer taught me the value of consistency, punctuality and hard work. It helped me develop a strong sense of responsibility and gave me a deeper appreciation for what it means to earn your own money through commitment and effort.",
        "logo": "../images/logos/fk.svg",
        "link": "https://fk.dk/bliv-omdeler/"
    }
]